1) პაიტონში ცვლადი არის სიმბოლური სახელი რომელიც ეხება კომპიუტერის მეხსიერებაში შენახულ ობიექტს ან მნიშვნელობას.

2)კლასიფიკაცია, რომელიც განსაზღვრავს თუ რა ტიპის მნიშვნელობა შეიძლება ჰქონდეს ცვლადს და რა ოპერაციების შესრულებაა შესაძლებელი მასზე.

3)ტექსტზე დაფუძნებული ინტერფეისი თქვენს კომპიუტერზე რომელიც  საშუალებას გაძლევთ გასცეთ ბრძანების ოპერაციულ სისტემას

4)printს რადგან შედეგები გამოიტანოს.

5)კოდის ტექსტის  ხაზი რომელსაც ინტერპრეტატორი უგულებელყოფს შესრულების დროს.

6)string float boolean  interger

7)წესების ერთბლიობა რომელიც არეგულირებს კოდის სტრუქტურასა და ფორმატს

8)interger
 
9)* / ""

10)true and False

11)რაღაც, რაც სისტემაში ორგანიზაციაში ან მანქანაში და შედის მისი მუშაობის ან ფუნქციონირებისთვის.

12)კომპიუტერულ მეცნიერებაში, ფუნქცია შეიძლება აღებული იყოს როგორც შემავალი მონაცემები უფრო მაღალი რიგის ფუნქციით.

13)name=input("enter your name")

14)low level არის კომპიუტერების ენა ხოლო high level არის ადამიანის ენა

15) იმიტომ რომ low level კომპიტერის ენა და მარტივად აკეთებს და high level არის ადამიანის ენასთან ახლოს.

16)პირობითი ოპერატორი არის შემოკლებული გზა მარტივი if-else ოპერატორის კოდის ერთ სტრიქონში ჩასაწერად.

17)პაითონში if-else ოპერატორი არის მართვის ნაკადის სტრუქტურა, რომელიც პროგრამას საშუალებას აძლევს შეასრულოს კოდის სხვადასხვა ბლოკი იმის მიხედვით არის თუ არა მოცემული პირობა True or False

18)პაითონში ლოგიკური ოპერატორები (and,or და not) გამოიყენება პირობითი ოპერატორის გასაერთიანებლად ან პირობის ლოგიკური მდგომარეობის შესაცვლელად.
