for i in range(15):
    print("w220")

for i in range(1,20+1):
    print(i)

for i in range(2,20+1,2):
    print(i)

for i in range(1,20+3,2):
    print(i)    

word="miyvarxar"
for i in word:
    print(i)

list="vashli,banani,atami"
for i in list:
    print("vashli, banani, atami")

fruit="me miyavrs vashli, banani, qliavi ,"
for i in fruit:
    print("me miyavrs vashli, banani, qliavi")


#low chart (ფლოუ ჩარტი) — ეს არის დიაგრამის ტიპი, რომელიც ასახავს პროცესს,
# სისტემას ან კომპიუტერულ ალგორითმს. ის იყენებს სხვადასხვა გეომეტრიულ ფიგურებს, 
# რომლებიც დაკავშირებულია ისრებითა და ხაზებით, რათა აჩვენოს ნაბიჯების თანმიმდევრობა და 
# გადაწყვეტილების მიღების პროცესი [1].


#Sequencing (თანმიმდევრობა): ეს არის ნაგულისხმევი და ყველაზე მარტივი კონსტრუქცია. 
#ინსტრუქციები სრულდება ზუსტად იმ თანმიმდევრობით, 
#რა თანმიმდევრობითაც არის დაწერილი, ერთმანეთის მიყოლებით, ზემოდან ქვემოთ

#Selection (არჩევა): ეს კონსტრუქცია (როგორიცაა if...else განაცხადი) საშუალებას აძლევს პროგრამას, 
#მიიღოს გადაწყვეტილება ლოგიკური მდგომარეობის საფუძველზე (მაგალითად, ჭეშმარიტია თუ არა რაიმე პირობა). 
#სხვადასხვა ბლოკი კოდი შესრულდება იმის მიხედვით, თუ რა არის პირობის შედეგი.

#Iteration (განმეორება): ეს კონსტრუქცია (როგორიცაა for ან while ციკლი) საშუალებას აძლევს კოდის 
#კონკრეტულ ნაწილს, შესრულდეს განმეორებით, 
#სანამ გარკვეული პირობა არ შესრულდება ან სანამ არ დასრულდება ელემენტების კოლექციის გავლა.


#ალგორითმი არის პროცედურების ან წესების მკაფიოდ განსაზღვრული თანმიმდევრობა, 
#რომელიც შექმნილია კონკრეტული პრობლემის გადასაჭრელად ან დავალების შესასრულებლად [1].







