თეგი- ნებისმიერი საიტზე, ბლოგზე, ფორუმზე, ვიდეო- ან ფოტომასალაზე მიმაგრებული საძიებო სიტყვა რომელიც აღნიშნავს ამა თუ იმ მასალის მიკუთვნებას გარკვეული კატეგორისადმი,
html- ელემენტი, რომელიც იყენებს როგორც გახსნის, ასევე დახურვის ტეგებს სხვა კონტენტის შესახვევად და ორგანიზებისთვის.
emphy tag-HTML ელემენტი, რომელსაც არ სჭირდება დახურვის ტეგი, რადგან მას არ შეუძლია შეიცავდეს რაიმე შინაარსს, როგორიცაა ტექსტი ან სხვა ელემენტი.
artibute-პიროვნების, ობიექტის ან ერთეულის განმასხვავებელი მახასიათებელი, თვისება ან თვისება.
tags list-html, xml, git, or social media. <html> <head> <title> <body> <!doctype>
A tags list-არის საკვანძო სიტყვების ან მოკლე ფრაზენის ერთობლიობა, რომელიც გამოიყენება ინფორმაციის, კატეგორიზაციისთვის, აღწერისა და ორგანიზებისთვის , ძიებისა და მართის გასაადვილებლად.
დალაგებულ და დაულაგებელ სიებს შორის მთავარი განსხვავება მათი ელემენტების განლაგებაა.

